// imports
import { RecruitItem } from 'features/recruit/types';

// constants
const recruitImagePath = `/images/recruit`;

export const id1: RecruitItem = {
  id: `1`,
  title: `【React・TypeScript】フロントエンドエンジニアを大募集！！`,
  image: { src: `${recruitImagePath}/id1.png` },
  date: `2022/10/25`,
  content: `■仕事の概要
【業務内容】React・TypeScriptを使ったフロントエンド開発
【勤務時間】AM9:00-PM6:00（休憩１時間）
【勤務地】新潟市西区五十嵐営業所
【給与】月収25~35万円
【スキル】React、Next.js、JavaScript、TypeScript、Git、Docker、AWS、GCP等
【休暇・休日】完全週休2日制／土日  祝日 

【その他】試用期間3ヶ月

ReactやTypeScriptといったモダンなWeb技術を使ったフロントエンドエンジニアを募集しています。
わたしたちの、MISSIONやVALUEに共感し、一緒に世界を作っていきたい方是非お待ちしております。

【具体的な業務】
Webのフロントエンド開発および用件定義やシステム設計、システムの運用
□開発：React(Next.js)・TypeScriptを使用したWebフロントエンド開発
□設計：お客様のご要望をもとにした用件定義・システム設計の作成
□運用：自社サービス等のシステム運用
フロントエンドエンジニアとして幅広い業務を行っていただきます。経験者や豊富なスキルセットをお持ちの方は優遇させていただきます。

【必要なスキル】
□React、Next.jsの実務経験
□JavaScript、TypeScriptの実務経験
□自分で考えて行動する能力

【望ましいスキル】
□Git、GitHubの使用経験
□Dockerの使用経験
□AWSやGCP等のクラウドサービスの実務経験

【求める人物像】
われわれはベンチャー企業です。一般的な企業と異なり、マニュアルがすべてあるわけではないため、時には考えて行動することが求められます。ともにエンジニアとしてスキルアップしたいと考える成長意欲のある方は大歓迎です！新しいことにチャレンジしたい方、一緒にITベンチャーを盛り上げたい方、気になったらご応募ください。モダンなWeb技術を使用したフロントエンド開発にご興味のある方もお待ちしております。
【選考方法】
1.コンタクトフォームより応募
2.書類選考（①履歴書、②職務経歴書、③マイビジョンシートの提出）
3.面接
4.ご連絡
`,
};
// ※マイビジョンシートについてはこちら（https://…..)を参照ください。

export const id2: RecruitItem = {
  id: `2`,
  title: `【20代が活躍】若手急成長ITベンチャーの
バックオフィスを大募集！！`,
  image: { src: `${recruitImagePath}/id2.jpg` },
  date: `2022/10/25`,
  content: `■仕事の概要
【業務内容】バックオフィス業務
【勤務時間】AM9:00-PM6:00（休憩１時間）
【勤務地】新潟市西区五十嵐営業所
【給与】時給1000円〜1800円（月ー金）又は月収17~23万円
【スキル】パソコンの簡単な操作、電話対応、書類作成等一般的な事務
【休暇・休日】完全週休2日制／土日  祝日 
【その他】試用期間1ヶ月

さらなる成長を目指し、バックオフィス業務をおこなっていただける方を募集します。
わたしたちの、MISSIONやVALUEに共感し、一緒に世界を作っていきたい方是非お待ちしております。

【具体的な業務】
入社後は、バックオフィスの専任担当者として下記の業務にあたっていただきます。
□経理：会計業務（領収書や請求書の発行確認＆配送）や支払い業務
□人事＆労務：求人ポータル管理、入社手続き、退社手続き、社保の更新等
□総務：コワーキングカフェの運営（問い合わせ、備品管理、人材管理）、書類作成＆送付等
の幅広い業務を行っていただきます。経験者は優遇させていただきます。

【必要なスキル】
□パソコンに操作（ワードやパワポなど一般的なもの）
□電話対応スキル
□自分で考えて行動する能力

【求める人物像】
われわれはベンチャー企業です。一般的な企業と異なり、マニュアルがすべてあるわけではないため、時には考えて行動することが求められます。とはいえ、チームワークを大事にしておりますので先輩がフォローします！新しいことにチャレンジしたい方、一緒にITベンチャーを盛り上げたい方、気になったらご応募ください。また、バックオフィスの領域を超えて、様々なことにチャレンジしたい方もお待ちしております。

【選考方法】
1.コンタクトフォームより応募
2.書類選考（①履歴書、②職務経歴書、③マイビジョンシートの提出）
3.面接
4.ご連絡
`,
};
// ※マイビジョンシートについてはこちら（https://…..)を参照ください。
